tap "argoproj/tap"
tap "heroku/brew"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "coreutils"
brew "libyaml"
brew "readline"
brew "asdf"
brew "bat"
brew "colima"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "docker-machine-driver-vmware"
brew "emojify"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gmailctl"
brew "gnu-sed"
brew "netpbm"
brew "gron"
brew "hub"
brew "imagemagick"
brew "jo"
brew "jq"
brew "less"
brew "mysql-client@5.7"
brew "nano"
brew "nkf"
brew "plantuml"
brew "qrencode"
brew "reattach-to-user-namespace"
brew "shellcheck"
brew "source-highlight"
brew "terraform"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "heroku/brew/heroku"
brew "hidetatz/tap/kubecolor"
brew "teamookla/speedtest/speedtest"
