tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "sanemat/font"
tap "teamookla/speedtest"
brew "readline"
brew "ansible"
brew "autossh"
brew "awscli"
brew "bat"
brew "libffi"
brew "cmigemo"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "docker-machine-driver-xhyve"
brew "emojify"
brew "expect"
brew "fzf"
brew "gh"
brew "git"
brew "global"
brew "gnu-sed"
brew "imagemagick"
brew "ipmitool"
brew "ispell"
brew "jq"
brew "less"
brew "libcroco"
brew "libiconv"
brew "librsvg"
brew "libxml2"
brew "libxslt"
brew "minikube"
brew "multimarkdown"
brew "mysql@5.6", link: true
brew "nkf"
brew "nodenv"
brew "nomad"
brew "p7zip"
brew "parallel"
brew "plantuml"
brew "python-yq"
brew "rabbitmq"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "s3cmd"
brew "source-highlight"
brew "sshpass"
brew "terraform"
brew "tmux"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-spacemacs-icon"]
brew "heroku/brew/heroku"
brew "sanemat/font/ricty", args: ["with-powerline"]
brew "teamookla/speedtest/speedtest"
cask "minikube"
cask "vagrant"
